app/controllers/books_controller.rb

  def create
    @book=Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "kandytown"], ["body", "rapstar"], ["created_at", "2022-10-03 13:11:34.483670"], ["updated_at", "2022-10-03 13:11:34.483670"]]

  def update
    book = Book.find(params[:id])
    book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 22], ["LIMIT", 1]]
UPDATE "books" SET "body" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["body", "ssxx"], ["updated_at", "2022-10-04 13:33:45.219042"], ["id", 17]]